In [1]:
import os
import re
import pandas as pd

In [2]:
data_path = '../cleaned_data/cleaned_datamaster_data.csv'

In [3]:
df = pd.read_csv(data_path)

In [4]:
df.head()

,User_Id,NAV_Category,IDV_Category,Owned,Parking_Space,Anti_Theft,Commute,Locality,DL_Suspended,State,...,year,Price,Liability Coverage,Comp,Collision,Car Rental,Umbrella,PIP,Med,Gap
0,5,I,I,Yes,IN,No,Leisure,Rural,No,North Carolina,...,2019,13767.0000,'30/60/25',Comprehensive Coverage,NaN,Car Rental I,NaN,Personal Injury Protection,Med Pay,NaN
1,6,I,I,Yes,OUT,Yes,Work,Rural,No,New York,...,2019,13767.0000,'25/50/10',NaN,NaN,NaN,NaN,Personal Injury Protection,Med Pay,NaN
2,14,I,I,Yes,OUT,No,Leisure,Rural,No,New Mexico,...,2017,12580.0000,'25/50/10',Comprehensive Coverage,NaN,Car Rental I,NaN,NaN,NaN,NaN
3,15,I,I,Yes,IN,No,Work,Rural,No,Colorado,...,2019,14103.2314,'25/50/15',Comprehensive Coverage,NaN,Car Rental I,NaN,Personal Injury Protection,Med Pay,NaN
4,16,I,I,Yes,IN,No,Leisure,Rural,No,Tennessee,...,2016,14595.0000,'25/50/10',Comprehensive Coverage,NaN,Car Rental I,NaN,Personal Injury Protection,Med Pay,NaN

In [5]:
df.columns

Index(['User_Id', 'NAV_Category', 'IDV_Category', 'Owned', 'Parking_Space',
       'Anti_Theft', 'Commute', 'Locality', 'DL_Suspended', 'State', 'makeId',
       'modelId', 'makeName', 'modelName', 'usage', 'year', 'Price',
       'Liability Coverage', 'Comp', 'Collision', 'Car Rental', 'Umbrella',
       'PIP', 'Med', 'Gap'],
      dtype='object')

In [7]:
 
# /****** Object:  Table [dbo].[CarMake]    Script Date: 28-08-2019 17:43:47 ******/


'''
CREATE TABLE CarMake(
	`MakeId`varchar(50) NOT NULL,
	`MakeName` varchar(50) NULL
);
'''

'\nCREATE TABLE CarMake(\n\t`MakeId`varchar(50) NOT NULL,\n\t`MakeName` varchar(50) NULL\n);\n'

In [8]:
carmake_df = df[['makeId','makeName']]
carmake_df.head(2)

   makeId makeName
0   20064  Hyundai
1   20064  Hyundai

In [9]:
len(carmake_df)

3432

In [10]:
len(carmake_df.drop_duplicates())

44

In [11]:
CarMake = carmake_df.drop_duplicates()

CarMake.to_csv("../cleaned_data/CarMake.csv",index=False)

In [12]:
# /****** Object:  Table [dbo].[CarMakeYear]    Script Date: 28-08-2019 17:43:48 ******/

''' 
CREATE TABLE CarMakeYear(
	`ModelId` varchar(50) NULL,
	`Year` int NULL
);
'''

' \nCREATE TABLE CarMakeYear(\n\t`ModelId` varchar(50) NULL,\n\t`Year` int NULL\n);\n'

In [13]:
carmakeyear_df  = df[['modelId','year']]
carmakeyear_df.head(2)

   modelId  year
0    21073  2019
1    30263  2019

In [20]:
carmakeyear_df.to_csv("../cleaned_data/CarMakeYear.csv",index=False)

In [ ]:
# /****** Object:  Table [dbo].[CarModel]    Script Date: 28-08-2019 17:43:48 ******/

''' 
CREATE TABLE CarModel(
	`MakeId` varchar(50) NOT NULL,
	`ModelId` varchar(50) NULL,
	`ModelName` varchar(255) NULL
);
'''

In [14]:
carmodel_df = df[['makeId','modelId', 'modelName']]
carmodel_df.head(2)

   makeId  modelId     modelName
0   20064    21073     Entourage
1   20064    30263  GenesisCoupe

In [26]:
carmodel_df.to_csv("../cleaned_data/CarModel.csv",index=False)

In [23]:
# /****** Object:  Table [dbo].[Cars]    Script Date: 28-08-2019 17:43:48 ******/
'''
 
CREATE TABLE Cars(
	`ModelId` varchar(50) NULL,
	`Usage` varchar(50) NULL,
	`Year` int NULL,
	`IDV_Category` varchar(10) NULL,
	`Price` int NULL
);

'''

'\n \nCREATE TABLE Cars(\n\t`ModelId` varchar(50) NULL,\n\t`Usage` varchar(50) NULL,\n\t`Year` int NULL,\n\t`IDV_Category` varchar(10) NULL,\n\t`Price` int NULL\n);\n\n'

In [15]:
cars_df = df[['modelId','usage','year','IDV_Category', 'Price']]

In [16]:
len(cars_df),len(cars_df.drop_duplicates())

(3432, 1236)

In [24]:
cars_df.to_csv("../cleaned_data/Cars.csv",index=False)

In [25]:
# /****** Object:  Table [dbo].[Cars_Master]    Script Date: 28-08-2019 17:43:48 ******/

'''                
CREATE TABLE Cars_Master(
	`MakeID` varchar(50) NOT NULL,
	`ModelID` varchar(50) NULL,
	`MakeName` varchar(50) NULL,
	`Usage` varchar(50) NULL,
	`Year` int NULL,
	`IDV_Category` varchar(10) NULL,
	`Price` int NULL,
	`ModelName` varchar(255) NULL
);
'''

'                \nCREATE TABLE Cars_Master(\n\t`MakeID` varchar(50) NOT NULL,\n\t`ModelID` varchar(50) NULL,\n\t`MakeName` varchar(50) NULL,\n\t`Usage` varchar(50) NULL,\n\t`Year` int NULL,\n\t`IDV_Category` varchar(10) NULL,\n\t`Price` int NULL,\n\t`ModelName` varchar(255) NULL\n);\n'

In [17]:
Cars_Master_df = df[['makeId','modelId', 'makeName', 'usage', 'year', 'IDV_Category', 'Price', 'modelName']]

In [18]:
len(Cars_Master_df),len(Cars_Master_df.drop_duplicates())

(3432, 1238)

In [19]:
Cars_Master = Cars_Master_df.drop_duplicates()

Cars_Master.to_csv("../cleaned_data/Cars_Master.csv",index=False)